# Hierarchical Indexing

multiple (two or more) index levels on an axis

In [1]:
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(9),
                    index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.954885
   2    0.715814
   3   -1.936285
b  1   -1.626588
   3   -0.022074
c  1    0.204172
   2    0.805057
d  2    0.518046
   3   -0.197629
dtype: float64

# partial indexing

In [2]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [4]:
print(data)
data['a']

a  1    0.954885
   2    0.715814
   3   -1.936285
b  1   -1.626588
   3   -0.022074
c  1    0.204172
   2    0.805057
d  2    0.518046
   3   -0.197629
dtype: float64

1    0.954885
2    0.715814
3   -1.936285
dtype: float64

# inner level selection

In [6]:
print(data)
data[:,3]

a  1    0.954885
   2    0.715814
   3   -1.936285
b  1   -1.626588
   3   -0.022074
c  1    0.204172
   2    0.805057
d  2    0.518046
   3   -0.197629
dtype: float64

a   -1.936285
b   -0.022074
d   -0.197629
dtype: float64

In [7]:
print(data)
data.unstack()

a  1    0.954885
   2    0.715814
   3   -1.936285
b  1   -1.626588
   3   -0.022074
c  1    0.204172
   2    0.805057
d  2    0.518046
   3   -0.197629
dtype: float64

          1         2         3
a  0.954885  0.715814 -1.936285
b -1.626588       NaN -0.022074
c  0.204172  0.805057       NaN
d       NaN  0.518046 -0.197629

In [8]:
# can you put back hierarchical index
data.unstack().stack()

a  1    0.954885
   2    0.715814
   3   -1.936285
b  1   -1.626588
   3   -0.022074
c  1    0.204172
   2    0.805057
d  2    0.518046
   3   -0.197629
dtype: float64

# DataFrame

In [20]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                             ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [12]:
frame['Ohio']

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

# Converting columns to index

In [13]:
frame = pd.DataFrame({'a': np.random.randint(0, high =10, size =7), 'b': range(7, 0, -1),
                          'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  2  7  one  0
1  7  6  one  1
2  0  5  one  2
3  1  4  two  0
4  6  3  two  1
5  8  2  two  2
6  6  1  two  3

In [15]:
print(frame)
frame.set_index(['a', 'b'])

   a  b    c  d
0  2  7  one  0
1  7  6  one  1
2  0  5  one  2
3  1  4  two  0
4  6  3  two  1
5  8  2  two  2
6  6  1  two  3

       c  d
a b
2 7  one  0
7 6  one  1
0 5  one  2
1 4  two  0
6 3  two  1
8 2  two  2
6 1  two  3

sorting index

In [16]:
frame.set_index(['a', 'b']).sort_index()

       c  d
a b
0 5  one  2
1 4  two  0
2 7  one  0
6 1  two  3
  3  two  1
7 6  one  1
8 2  two  2

In [19]:
# can you revert the hierachical indexing
frame.set_index(['a', 'b']).sort_index().reset_index()

   a  b    c  d
0  0  5  one  2
1  1  4  two  0
2  2  7  one  0
3  6  1  two  3
4  6  3  two  1
5  7  6  one  1
6  8  2  two  2

# Reordering and Sorting Levels

In [21]:
frame.swaplevel()

     Ohio     Colorado
    Green Red    Green
1 a     0   1        2
2 a     3   4        5
1 b     6   7        8
2 b     9  10       11

# Simple stats

In [22]:
# let's give name to columns
frame.index.names= ['k1', 'k2']
frame

       Ohio     Colorado
      Green Red    Green
k1 k2
a  1      0   1        2
   2      3   4        5
b  1      6   7        8
   2      9  10       11

In [23]:
# find the sum based on k2
frame.sum(level='k2')

    Ohio     Colorado
   Green Red    Green
k2
1      6   8       10
2     12  14       16

# Combining and Merging Datasets
- pandas.merge(SQL join) connects rows in DataFrames based on one or more keys. 
- pandas.concat concatenates or “stacks” together objects along an axis

In [24]:
df1 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                        'data1': range(7)})
df1

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [25]:
df2 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
df2

   data2 rkey
0      0    a
1      1    b
2      2    d

In [26]:
# inner join
pd.merge(df1, df2, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [60]:
pd.merge(df1, df2, left_on='lkey', right_on='rkey', how='outer')

   data1 lkey  data2 rkey
0    0.0    b    1.0    b
1    1.0    b    1.0    b
2    6.0    b    1.0    b
3    2.0    a    0.0    a
4    4.0    a    0.0    a
5    5.0    a    0.0    a
6    3.0    c    NaN  NaN
7    NaN  NaN    2.0    d